10/data/attachments/ec923b9419279f7e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_da43d4b2-65a0-4329-bc51-925740fe1f36</nif:username>
            <nif:friendToBeAdded>David_sound_Friend_36307_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>